app/views/import_results_from_urls/_form.html.erb

  <%= f.label :import_type, :class => 'control-label' %>
  <%= f.select :import_type, [['Triatlo FTP Sem Transições' , 'short_ftp_triathlon'], ['Triatlo FTP Com Transições' , 'long_ftp_triathlon'], [ 'Triatlo FTP Sem sectores', 'zero_ftp_triathlon']] %>
---
SELECT "race_types".* FROM "race_types"

    <%= f.label :global_race_id, :class => 'control-label' %>
  <%= f.collection_select(:global_race_id, GlobalRace.all, :id, :name) %>
---
SELECT "global_races".* FROM "global_races"

  <%= f.label :competition_id, :class => 'control-label' %>
  <%= f.collection_select(:competition_id, Competition.all, :id, :name) %>
---
SELECT "competitions".* FROM "competitions"