app/controllers/athletes_controller.rb

SELECT "athletes".* FROM "athletes"
---
  def index
    @athletes = Athlete.all