app/controllers/competitions_controller.rb

SELECT "competitions".* FROM "competitions"
---
  def index
    @competitions = Competition.all

INSERT INTO "competitions" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Mon, 29 Jul 2013 12:50:29 UTC +00:00], ["updated_at", Mon, 29 Jul 2013 12:50:29 UTC +00:00]]
---
  def create
    @competition = Competition.new(competition_params)

    respond_to do |format|
      if @competition.save

DELETE FROM "competitions" WHERE "competitions"."id" = $1  [["id", 1]]
---
  def destroy
    @competition.destroy

SELECT "competitions".* FROM "competitions" WHERE "competitions"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_competition
      @competition = Competition.find(params[:id])