app/controllers/import_short_ftp_triathlons_controller.rb

SELECT "import_short_ftp_triathlons".* FROM "import_short_ftp_triathlons"
---
  def index
    @import_short_ftp_triathlons = ImportShortFtpTriathlon.all