app/controllers/import_results_from_urls_controller.rb

  def index
    @import_results_from_urls = ImportResultsFromUrl.all
---
SELECT "import_results_from_urls".* FROM "import_results_from_urls"

  def new
    @import_results_from_url = ImportResultsFromUrl.new
    @race_types = RaceType.all
---
SELECT "race_types".* FROM "race_types"

  def create
    @import_results_from_url = ImportResultsFromUrl.new(import_results_from_url_params)

    respond_to do |format|
      if @import_results_from_url.save
---
INSERT INTO "import_results_from_urls" ("created_at", "import_type", "race_type_id", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 29 Jul 2013 11:31:38 UTC +00:00], ["import_type", "short_ftp_triathlon"], ["race_type_id", 3], ["updated_at", Mon, 29 Jul 2013 11:31:38 UTC +00:00], ["url", "fsdfsdfs"]]

  def destroy
    @import_results_from_url.destroy
---
DELETE FROM "import_results_from_urls" WHERE "import_results_from_urls"."id" = $1  [["id", 1]]

    def set_import_results_from_url
      @import_results_from_url = ImportResultsFromUrl.find(params[:id])
---
SELECT "import_results_from_urls".* FROM "import_results_from_urls" WHERE "import_results_from_urls"."id" = $1 LIMIT 1  [["id", "13"]]